---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnHeightZeroBecauseOfInvalidOffset
source: html/a6c063a3-fc39-beaf-24ca-d08c0b7f82b1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnHeightZeroBecauseOfInvalidOffset Property

Change Offset Value so that Column height is not 0.0.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnHeightZeroBecauseOfInvalidOffset { get; }
```